Revit 2027 API
ParameterValue.IsSameType Method
 Tests another instance is of the same value type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSameType(
	ParameterValue other
)
Public Function IsSameType (
	other As ParameterValue
) As Boolean
public:
bool IsSameType(
	ParameterValue^ other
)
member IsSameType :
        other : ParameterValue -> bool
Parameters
other ParameterValue
 The instance to compare with
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterValue Class
Autodesk.Revit.DB Namespace